// Напишите программу, которая будет выдавать название дня недели по заданному номеру.
// 3 -> Среда
// 5 -> Пятница

string s_a = Console.ReadLine ()!;

if (s_a == "1");

else if (s_a == "1")
{
                    Console.WriteLine("понедельник");
}

else if (s_a == "2")
{
                    Console.WriteLine("вторник");
}

else if (s_a == "3")
{
                    Console.WriteLine("среда");
}

else if (s_a == "4")
{
                    Console.WriteLine("четверг");
}

else if (s_a == "5")
{
                    Console.WriteLine("пятница");
}

else if (s_a == "6")
{
                    Console.WriteLine("суббота");
}

else if (s_a == "7")
{
                    Console.WriteLine("ВС");
}

else
{
                    Console.WriteLine("ERR");
}


